test/Stripe.Tests/infrastructure/test_data/charge.json

{
  "id": "ch_155fsN2eZvKYlo2CGqYDyqla",
  "object": "charge",
  "created": 1417623675,
  "livemode": false,
  "paid": true,
  "amount": 20000,
  "currency": "usd",
  "refunded": false,
  "captured": true,
  "refunds": {
    "object": "list",
    "total_count": 0,
    "has_more": false,
    "url": "/v1/charges/ch_155fsN2eZvKYlo2CGqYDyqla/refunds",
    "data": [

    ]
  },
  "card": {
    "id": "card_14CBxd2eZvKYlo2C99dkTB14",
    "object": "card",
    "last4": "4242",
    "brand": "Visa",
    "funding": "credit",
    "exp_month": 12,
    "exp_year": 2014,
    "fingerprint": "Xt5EWLLDS7FJjR1c",
    "country": "US",
    "name": null,
    "address_line1": null,
    "address_line2": null,
    "address_city": null,
    "address_state": null,
    "address_zip": null,
    "address_country": null,
    "cvc_check": null,
    "address_line1_check": null,
    "address_zip_check": null,
    "dynamic_last4": null,
    "customer": "cus_4KrhtWKRbXk69Y"
  },
  "balance_transaction": "txn_153Otp2eZvKYlo2CgqvbRlEA",
  "failure_message": null,
  "failure_code": null,
  "amount_refunded": 0,
  "customer": "cus_4KrhtWKRbXk69Y",
  "invoice": "in_155eu32eZvKYlo2C28zCWkfV",
  "description": null,
  "dispute": null,
  "metadata": {
  },
  "statement_description": null,
  "fraud_details": {
    "stripe_report": "unavailable",
    "user_report": null
  },
  "receipt_email": null,
  "receipt_number": null,
  "shipping": null
}